
LEXICON_COMMANDS: dict[str, str] = {

    'start': 'Привет!\nДанный бот позволяет читать книгу '
             'Рэя Брэдбери "Марсианские хроники" в диалоговом окне\n\n'
             'Для просмотра команд введите /help',

    'help': '<b>Доступные команды:</b>\n'
            '/help - просмотр доступных команд\n'
            '/beginning - перейти в начало книги\n'
            '/continue - продолжить чтение\n'
            '/bookmarks - посмотреть закладки',

    'help_menu': 'Просмотр доступных команд',

    'continue': 'Продолжить чтение',

    'beginning': 'Начать чтение с первой страницы',

    'bookmarks': 'Посмотреть закладки'

}
LEXICON: dict[str, str] = {

    'other': 'Данный бот предназначен для чтения, он не умеет отвечать :-(',

    'no_bookmarks': '<b>У вас нету ни одной закладки</b>\n\n'
                    'Чтобы добавить страницу в закладки - '
                    'во время чтения нажмите на кнопку с номером этой страницы',

    'edit_bookmarks': 'Удалить закладки',

    'offer_to_read': '/continue - продолжить чтение',

    'add_bookmark': 'Страница добавлена в закладки',

    'bookmark_exists': 'Страница уже была добавлена в закладки',

    'your_bookmarks': 'Ваши закладки:'


}
LEXICON_KB_BTN: dict[str, str] = {
    'backward': '<<',
    'forward': '>>',
    'cancel': 'Отменить',
    'edit': '❌ Редактировать',
    'x': '❌'
}
